In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect(r'./countries/countries.db')
def rsq(sql):
    return pd.read_sql(sql, conn)

In [3]:
rsq("""-- Select all fields from economies2015
-- ___    
-- Set operation
-- ___
-- Select all fields from economies2019
SELECT * FROM economies2015
UNION
SELECT * FROM economies2019
ORDER BY code, year;""").head()

  code  year         income_group  gross_savings
0  ABW  2015          High income      14.867852
1  AGO  2015  Lower middle income      25.021327
2  AGO  2019  Lower middle income      25.524848
3  ALB  2015  Upper middle income      16.863981
4  ALB  2019  Upper middle income      14.499826

In [6]:
rsq("""-- Query that determines all pairs of code and year from economies and populations, without duplicates
SELECT code, year
FROM economies
UNION
SELECT country_code, year
FROM populations;""").shape

(434, 2)

In [8]:
rsq("""SELECT code, year
FROM economies
-- Set theory clause
UNION all
SELECT country_code, year
FROM populations
ORDER BY code, year;""").shape

(814, 2)

In [9]:
rsq("""-- Return all cities with the same name as a country
SELECT name
FROM cities
INTERSECT
SELECT name
FROM countries;""")

        name
0  Singapore

In [11]:
rsq("""-- Return all cities that do not have the same name as a country
SELECT name 
FROM cities
EXCEPT
SELECT name
FROM countries
ORDER BY name;""").shape

(235, 1)